{
  "document": {
    "@odata.type": "#microsoft.graph.iosCompliancePolicy",
    "id": "7bdb5267-b7d2-4281-bfe2-e236cc546a4a",
    "createdDateTime": "2020-02-05T16:30:38.8612049Z",
    "description": "",
    "lastModifiedDateTime": "2020-02-05T16:30:38.8612049Z",
    "version": 1,
    "passcodeBlockSimple": false,
    "passcodeExpirationDays": null,
    "passcodeMinimumLength": null,
    "passcodeMinutesOfInactivityBeforeLock": null,
    "passcodePreviousPasscodeBlockCount": null,
    "passcodeMinimumCharacterSetCount": null,
    "passcodeRequiredType": "deviceDefault",
    "passcodeRequired": false,
    "osMinimumVersion": null,
    "osMaximumVersion": null,
    "securityBlockJailbrokenDevices": false,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "managedEmailProfileRequired": false,
    "accountId": "a2e9d848-51aa-467b-a8ed-c8ad27fee718",
    "type": "",
    "name": "newPolicy"
  }
}