{
  "id": "9eaea9f3-f331-9ed7-1ea7-03808a396aef",
  "displayName": "Ensure that Separation of duties is enforced while assigning KMS related roles to users",
  "resourceType": "project#iamPolicy",
  "severity": "medium",
  "rationale": "Built-in/Predefined IAM role Cloud KMS Admin allows user/identity to create, delete, and manage service account(s). Built-in/Predefined IAM role Cloud KMS CryptoKey Encrypter/Decrypter allows user/identity (with adequate privileges on concerned resources) to encrypt and decrypt data at rest using encryption key(s). Built-in/Predefined IAM role Cloud KMS CryptoKey Encrypter allows user/identity (with adequate privileges on concerned resources) to encrypt data at rest using encryption key(s). Built-in/Predefined IAM role Cloud KMS CryptoKey Decrypter allows user/identity (with adequate privileges on concerned resources) to decrypt data at rest using encryption key(s). Separation of duties is the concept of ensuring that one individual does not have all necessary permissions to be able to complete a malicious action. In Cloud KMS, this could be an action such as using a key to access and decrypt data that that user should not normally have access to. Separation of duties is a business control typically used in larger organizations, meant to help avoid security or privacy incidents and errors. It is considered best practice. Any user(s) should not have Cloud KMS Adminand any of the Cloud KMS CryptoKey Encrypter/Decrypter, Cloud KMS CryptoKey Encrypter, Cloud KMS CryptoKey Decrypter roles assigned at a time.",
  "source": "cis gcp 1.0.0 | benchmark 1.9",
  "recommended_action": "1. Go to IAM & Admin/IAM using https://console.cloud.google.com/iam-admin/iam\n2. Ensure no member has roles Cloud KMS Admin and any of the Cloud KMS CryptoKey\nEncrypter/Decrypter, Cloud KMS CryptoKey Encrypter, Cloud KMS CryptoKey\nDecrypter assigned.",
  "error_message": "One or more users have the role of Cloud KMS Admin and one or more of the following:\nCloud KMS CryptoKey Encryptor,\nCloud KMS CryptoKey Decryptor,\nCloud KMS CryptoKey Encryptor/Decryptor",
  "category": "IA",
  "subcategory": "",
  "ruleNames": [
    "Ensure that separation of duties is enforced while assigning KMS related roles to users"
  ]
}