{
  "recommended_action": "IAM roles can only be associated at the launch of an instance. To remediate an instance to\nadd it to a role you must create a new instance.\nIf the instance has no external dependencies on its current private ip or public addresses are elastic IPs:\n1. In AWS IAM create a new role. Assign a permissions policy if needed permissions are already known.\n 2. In the AWS console launch a new instance with identical settings to the existing instance, and ensure that the newly created role is selected.\n3. Shutdown both the existing instance and the new instance.\n4. Detach disks from both instances.\n5. Attach the existing instance disks to the new instance.\n6. Boot the new instance and you should have the same machine, but with the associated role",
  "rationale": "AWS IAM roles reduce the risks associated with sharing and rotating credentials that can be used outside of AWS itself. If credentials are compromised, they can be used from outside of the AWS account they give access to. In contrast, in order to leverage role permissions an attacker would need to gain and maintain access to a specific instance to use the privileges associated with it. Additionally, if credentials are encoded into compiled applications or other hard to change mechanisms, then they are even more unlikely to be properly rotated due to service disruption risks. As time goes on, credentials that cannot be rotated are more likely to be known by an increasing number of individuals who no longer work for the organization owning the credentials.",
  "source": "cis aws 1.2.0",
  "properties": {
    "document": {
      "properties": {
        "IamInstanceProfile": {
          "errorMessage": "EC2 instance is not using correct IAM role.",
          "properties": {
            "arn": {
              "type": "string"
            },
            "id": {
              "type": "string"
            }
          },
          "required": ["arn", "id"]
        }
      },
      "required": ["IamInstanceProfile"]
    }
  },
  "schemaId": "f22ae111-a63e-470f-ad45-a316f200033a"
}
