{
  "accountId": "a2e9d848-51aa-467b-a8ed-c8ad27fee718",
  "id": "",
  "location": "global",
  "name": "",
  "type": "",
  "document": [{
      "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
      "id": "d30b1d3c-2e78-4cef-848a-2372cd1d218f",
      "lastModifiedDateTime": "2020-02-03T18:32:44.3409142Z",
      "createdDateTime": "2020-02-03T18:32:43.9916306Z",
      "description": "",
      "displayName": "After 10",
      "version": 2,
      "enterpriseCloudPrintDiscoveryEndPoint": null,
      "enterpriseCloudPrintOAuthAuthority": null,
      "enterpriseCloudPrintOAuthClientIdentifier": null,
      "enterpriseCloudPrintResourceIdentifier": null,
      "enterpriseCloudPrintDiscoveryMaxLimit": null,
      "enterpriseCloudPrintMopriaDiscoveryResourceIdentifier": null,
      "searchBlockDiacritics": false,
      "searchDisableAutoLanguageDetection": false,
      "searchDisableIndexingEncryptedItems": false,
      "searchEnableRemoteQueries": false,
      "searchDisableIndexerBackoff": false,
      "searchDisableIndexingRemovableDrive": false,
      "searchEnableAutomaticIndexSizeManangement": false,
      "diagnosticsDataSubmissionMode": "userDefined",
      "oneDriveDisableFileSync": false,
      "smartScreenEnableAppInstallControl": false,
      "personalizationDesktopImageUrl": null,
      "personalizationLockScreenImageUrl": null,
      "bluetoothAllowedServices": [],
      "bluetoothBlockAdvertising": false,
      "bluetoothBlockDiscoverableMode": false,
      "bluetoothBlockPrePairing": false,
      "edgeBlockAutofill": false,
      "edgeBlocked": false,
      "edgeCookiePolicy": "userDefined",
      "edgeBlockDeveloperTools": false,
      "edgeBlockSendingDoNotTrackHeader": false,
      "edgeBlockExtensions": false,
      "edgeBlockInPrivateBrowsing": false,
      "edgeBlockJavaScript": false,
      "edgeBlockPasswordManager": false,
      "edgeBlockAddressBarDropdown": false,
      "edgeBlockCompatibilityList": false,
      "edgeClearBrowsingDataOnExit": false,
      "edgeAllowStartPagesModification": false,
      "edgeDisableFirstRunPage": false,
      "edgeBlockLiveTileDataCollection": false,
      "edgeSyncFavoritesWithInternetExplorer": false,
      "cellularBlockDataWhenRoaming": false,
      "cellularBlockVpn": false,
      "cellularBlockVpnWhenRoaming": false,
      "defenderBlockEndUserAccess": false,
      "defenderDaysBeforeDeletingQuarantinedMalware": null,
      "defenderDetectedMalwareActions": null,
      "defenderSystemScanSchedule": "userDefined",
      "defenderFilesAndFoldersToExclude": [],
      "defenderFileExtensionsToExclude": [],
      "defenderScanMaxCpu": null,
      "defenderMonitorFileActivity": "userDefined",
      "defenderProcessesToExclude": [],
      "defenderPromptForSampleSubmission": "userDefined",
      "defenderRequireBehaviorMonitoring": false,
      "defenderRequireCloudProtection": false,
      "defenderRequireNetworkInspectionSystem": false,
      "defenderRequireRealTimeMonitoring": false,
      "defenderScanArchiveFiles": false,
      "defenderScanDownloads": false,
      "defenderScanNetworkFiles": false,
      "defenderScanIncomingMail": false,
      "defenderScanMappedNetworkDrivesDuringFullScan": false,
      "defenderScanRemovableDrivesDuringFullScan": false,
      "defenderScanScriptsLoadedInInternetExplorer": false,
      "defenderSignatureUpdateIntervalInHours": null,
      "defenderScanType": "userDefined",
      "defenderScheduledScanTime": null,
      "defenderScheduledQuickScanTime": null,
      "defenderCloudBlockLevel": "notConfigured",
      "lockScreenAllowTimeoutConfiguration": false,
      "lockScreenBlockActionCenterNotifications": false,
      "lockScreenBlockCortana": false,
      "lockScreenBlockToastNotifications": false,
      "lockScreenTimeoutInSeconds": null,
      "passwordBlockSimple": false,
      "passwordExpirationDays": null,
      "passwordMinimumLength": null,
      "passwordMinutesOfInactivityBeforeScreenTimeout": null,
      "passwordMinimumCharacterSetCount": null,
      "passwordPreviousPasswordBlockCount": null,
      "passwordRequired": false,
      "passwordRequireWhenResumeFromIdleState": false,
      "passwordRequiredType": "deviceDefault",
      "passwordSignInFailureCountBeforeFactoryReset": null,
      "privacyAdvertisingId": "notConfigured",
      "privacyAutoAcceptPairingAndConsentPrompts": false,
      "privacyBlockInputPersonalization": false,
      "startBlockUnpinningAppsFromTaskbar": false,
      "startMenuAppListVisibility": "userDefined",
      "startMenuHideChangeAccountSettings": false,
      "startMenuHideFrequentlyUsedApps": false,
      "startMenuHideHibernate": false,
      "startMenuHideLock": false,
      "startMenuHidePowerButton": false,
      "startMenuHideRecentJumpLists": false,
      "startMenuHideRecentlyAddedApps": false,
      "startMenuHideRestartOptions": false,
      "startMenuHideShutDown": false,
      "startMenuHideSignOut": false,
      "startMenuHideSleep": false,
      "startMenuHideSwitchAccount": false,
      "startMenuHideUserTile": false,
      "startMenuLayoutEdgeAssetsXml": null,
      "startMenuLayoutXml": null,
      "startMenuMode": "userDefined",
      "startMenuPinnedFolderDocuments": "notConfigured",
      "startMenuPinnedFolderDownloads": "notConfigured",
      "startMenuPinnedFolderFileExplorer": "notConfigured",
      "startMenuPinnedFolderHomeGroup": "notConfigured",
      "startMenuPinnedFolderMusic": "notConfigured",
      "startMenuPinnedFolderNetwork": "notConfigured",
      "startMenuPinnedFolderPersonalFolder": "notConfigured",
      "startMenuPinnedFolderPictures": "notConfigured",
      "startMenuPinnedFolderSettings": "notConfigured",
      "startMenuPinnedFolderVideos": "notConfigured",
      "settingsBlockSettingsApp": false,
      "settingsBlockSystemPage": false,
      "settingsBlockDevicesPage": false,
      "settingsBlockNetworkInternetPage": false,
      "settingsBlockPersonalizationPage": false,
      "settingsBlockAccountsPage": false,
      "settingsBlockTimeLanguagePage": false,
      "settingsBlockEaseOfAccessPage": false,
      "settingsBlockPrivacyPage": false,
      "settingsBlockUpdateSecurityPage": false,
      "settingsBlockAppsPage": false,
      "settingsBlockGamingPage": false,
      "windowsSpotlightBlockConsumerSpecificFeatures": false,
      "windowsSpotlightBlocked": false,
      "windowsSpotlightBlockOnActionCenter": false,
      "windowsSpotlightBlockTailoredExperiences": false,
      "windowsSpotlightBlockThirdPartyNotifications": false,
      "windowsSpotlightBlockWelcomeExperience": false,
      "windowsSpotlightBlockWindowsTips": false,
      "windowsSpotlightConfigureOnLockScreen": "notConfigured",
      "networkProxyApplySettingsDeviceWide": false,
      "networkProxyDisableAutoDetect": false,
      "networkProxyAutomaticConfigurationUrl": null,
      "networkProxyServer": null,
      "accountsBlockAddingNonMicrosoftAccountEmail": false,
      "antiTheftModeBlocked": false,
      "bluetoothBlocked": false,
      "cameraBlocked": false,
      "connectedDevicesServiceBlocked": false,
      "certificatesBlockManualRootCertificateInstallation": false,
      "copyPasteBlocked": false,
      "cortanaBlocked": false,
      "deviceManagementBlockFactoryResetOnMobile": false,
      "deviceManagementBlockManualUnenroll": false,
      "safeSearchFilter": "userDefined",
      "edgeBlockPopups": false,
      "edgeBlockSearchSuggestions": false,
      "edgeBlockSendingIntranetTrafficToInternetExplorer": false,
      "edgeSendIntranetTrafficToInternetExplorer": false,
      "edgeRequireSmartScreen": false,
      "edgeEnterpriseModeSiteListLocation": null,
      "edgeFirstRunUrl": null,
      "edgeSearchEngine": null,
      "edgeHomepageUrls": [],
      "edgeBlockAccessToAboutFlags": false,
      "smartScreenBlockPromptOverride": false,
      "smartScreenBlockPromptOverrideForFiles": false,
      "webRtcBlockLocalhostIpAddress": false,
      "internetSharingBlocked": false,
      "settingsBlockAddProvisioningPackage": false,
      "settingsBlockRemoveProvisioningPackage": false,
      "settingsBlockChangeSystemTime": false,
      "settingsBlockEditDeviceName": false,
      "settingsBlockChangeRegion": false,
      "settingsBlockChangeLanguage": false,
      "settingsBlockChangePowerSleep": false,
      "locationServicesBlocked": false,
      "microsoftAccountBlocked": false,
      "microsoftAccountBlockSettingsSync": false,
      "nfcBlocked": false,
      "resetProtectionModeBlocked": false,
      "screenCaptureBlocked": false,
      "storageBlockRemovableStorage": false,
      "storageRequireMobileDeviceEncryption": false,
      "usbBlocked": false,
      "voiceRecordingBlocked": false,
      "wiFiBlockAutomaticConnectHotspots": false,
      "wiFiBlocked": false,
      "wiFiBlockManualConfiguration": false,
      "wiFiScanInterval": null,
      "wirelessDisplayBlockProjectionToThisDevice": false,
      "wirelessDisplayBlockUserInputFromReceiver": false,
      "wirelessDisplayRequirePinForPairing": false,
      "windowsStoreBlocked": false,
      "appsAllowTrustedAppsSideloading": "notConfigured",
      "windowsStoreBlockAutoUpdate": false,
      "developerUnlockSetting": "notConfigured",
      "sharedUserAppDataAllowed": false,
      "appsBlockWindowsStoreOriginatedApps": false,
      "windowsStoreEnablePrivateStoreOnly": false,
      "storageRestrictAppDataToSystemVolume": false,
      "storageRestrictAppInstallToSystemVolume": false,
      "gameDvrBlocked": false,
      "experienceBlockDeviceDiscovery": false,
      "experienceBlockErrorDialogWhenNoSIM": false,
      "experienceBlockTaskSwitcher": false,
      "logonBlockFastUserSwitching": false,
      "tenantLockdownRequireNetworkDuringOutOfBoxExperience": false
    },
    {
      "@odata.type": "#microsoft.graph.windows81GeneralConfiguration",
      "id": "d8d73837-0bf6-45f1-a728-151a5761717a",
      "lastModifiedDateTime": "2020-02-03T18:32:29.8418101Z",
      "createdDateTime": "2020-02-03T18:32:29.8418101Z",
      "description": "",
      "displayName": "After 8.1",
      "version": 1,
      "accountsBlockAddingNonMicrosoftAccountEmail": false,
      "applyOnlyToWindows81": false,
      "browserBlockAutofill": false,
      "browserBlockAutomaticDetectionOfIntranetSites": false,
      "browserBlockEnterpriseModeAccess": false,
      "browserBlockJavaScript": false,
      "browserBlockPlugins": false,
      "browserBlockPopups": false,
      "browserBlockSendingDoNotTrackHeader": false,
      "browserBlockSingleWordEntryOnIntranetSites": false,
      "browserRequireSmartScreen": false,
      "browserEnterpriseModeSiteListLocation": null,
      "browserInternetSecurityLevel": "userDefined",
      "browserIntranetSecurityLevel": "userDefined",
      "browserLoggingReportLocation": null,
      "browserRequireHighSecurityForRestrictedSites": false,
      "browserRequireFirewall": false,
      "browserRequireFraudWarning": false,
      "browserTrustedSitesSecurityLevel": "userDefined",
      "cellularBlockDataRoaming": false,
      "diagnosticsBlockDataSubmission": false,
      "passwordBlockPicturePasswordAndPin": false,
      "passwordExpirationDays": null,
      "passwordMinimumLength": null,
      "passwordMinutesOfInactivityBeforeScreenTimeout": null,
      "passwordMinimumCharacterSetCount": null,
      "passwordPreviousPasswordBlockCount": null,
      "passwordRequiredType": "deviceDefault",
      "passwordSignInFailureCountBeforeFactoryReset": null,
      "storageRequireDeviceEncryption": false,
      "updatesRequireAutomaticUpdates": false,
      "userAccountControlSettings": "userDefined",
      "workFoldersUrl": null
    },
    {
      "@odata.type": "#microsoft.graph.androidGeneralDeviceConfiguration",
      "id": "c8373d00-5fa0-4db2-bf5a-dea3725c2c6f",
      "lastModifiedDateTime": "2020-02-03T18:29:19.8917839Z",
      "createdDateTime": "2020-02-03T18:29:19.8917839Z",
      "description": "",
      "displayName": "Android",
      "version": 1,
      "appsBlockClipboardSharing": false,
      "appsBlockCopyPaste": false,
      "appsBlockYouTube": false,
      "bluetoothBlocked": false,
      "cameraBlocked": false,
      "cellularBlockDataRoaming": false,
      "cellularBlockMessaging": false,
      "cellularBlockVoiceRoaming": false,
      "cellularBlockWiFiTethering": false,
      "compliantAppListType": "none",
      "diagnosticDataBlockSubmission": false,
      "locationServicesBlocked": false,
      "googleAccountBlockAutoSync": false,
      "googlePlayStoreBlocked": false,
      "kioskModeBlockSleepButton": false,
      "kioskModeBlockVolumeButtons": false,
      "nfcBlocked": false,
      "passwordBlockFingerprintUnlock": false,
      "passwordBlockTrustAgents": false,
      "passwordExpirationDays": null,
      "passwordMinimumLength": null,
      "passwordMinutesOfInactivityBeforeScreenTimeout": null,
      "passwordPreviousPasswordBlockCount": null,
      "passwordSignInFailureCountBeforeFactoryReset": null,
      "passwordRequiredType": "deviceDefault",
      "passwordRequired": false,
      "powerOffBlocked": false,
      "factoryResetBlocked": false,
      "screenCaptureBlocked": false,
      "deviceSharingAllowed": false,
      "storageBlockGoogleBackup": false,
      "storageBlockRemovableStorage": false,
      "storageRequireDeviceEncryption": false,
      "storageRequireRemovableStorageEncryption": false,
      "voiceAssistantBlocked": false,
      "voiceDialingBlocked": false,
      "webBrowserBlockPopups": false,
      "webBrowserBlockAutofill": false,
      "webBrowserBlockJavaScript": false,
      "webBrowserBlocked": false,
      "webBrowserCookieSettings": "browserDefault",
      "wiFiBlocked": false,
      "securityRequireVerifyApps": false,
      "compliantAppsList": [],
      "kioskModeApps": [],
      "appsInstallAllowList": [],
      "appsLaunchBlockList": [],
      "appsHideList": []
    },
    {
      "@odata.type": "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration"
    }, {
      "@odata.type": "#microsoft.graph.iosGeneralDeviceConfiguration",
      "id": "68940934-70ce-48ea-9590-0451430fc13a",
      "lastModifiedDateTime": "2020-02-03T19:13:11.8023853Z",
      "createdDateTime": "2020-02-03T19:13:11.8023853Z",
      "description": "2",
      "displayName": "iOS",
      "version": 1,
      "accountBlockModification": false,
      "activationLockAllowWhenSupervised": false,
      "airDropBlocked": false,
      "airDropForceUnmanagedDropTarget": false,
      "airPlayForcePairingPasswordForOutgoingRequests": false,
      "appleWatchBlockPairing": false,
      "appleWatchForceWristDetection": false,
      "appleNewsBlocked": false,
      "appsVisibilityListType": "none",
      "appStoreBlockAutomaticDownloads": false,
      "appStoreBlocked": false,
      "appStoreBlockInAppPurchases": false,
      "appStoreBlockUIAppInstallation": false,
      "appStoreRequirePassword": false,
      "bluetoothBlockModification": false,
      "cameraBlocked": false,
      "cellularBlockDataRoaming": false,
      "cellularBlockGlobalBackgroundFetchWhileRoaming": false,
      "cellularBlockPerAppDataModification": false,
      "cellularBlockPersonalHotspot": false,
      "cellularBlockVoiceRoaming": false,
      "certificatesBlockUntrustedTlsCertificates": false,
      "classroomAppBlockRemoteScreenObservation": false,
      "classroomAppForceUnpromptedScreenObservation": false,
      "compliantAppListType": "none",
      "configurationProfileBlockChanges": false,
      "definitionLookupBlocked": false,
      "deviceBlockEnableRestrictions": false,
      "deviceBlockEraseContentAndSettings": false,
      "deviceBlockNameModification": false,
      "diagnosticDataBlockSubmission": false,
      "diagnosticDataBlockSubmissionModification": false,
      "documentsBlockManagedDocumentsInUnmanagedApps": false,
      "documentsBlockUnmanagedDocumentsInManagedApps": false,
      "emailInDomainSuffixes": [],
      "enterpriseAppBlockTrust": false,
      "enterpriseAppBlockTrustModification": false,
      "faceTimeBlocked": false,
      "findMyFriendsBlocked": false,
      "gamingBlockGameCenterFriends": false,
      "gamingBlockMultiplayer": false,
      "gameCenterBlocked": false,
      "hostPairingBlocked": false,
      "iBooksStoreBlocked": false,
      "iBooksStoreBlockErotica": false,
      "iCloudBlockActivityContinuation": false,
      "iCloudBlockBackup": false,
      "iCloudBlockDocumentSync": false,
      "iCloudBlockManagedAppsSync": false,
      "iCloudBlockPhotoLibrary": false,
      "iCloudBlockPhotoStreamSync": false,
      "iCloudBlockSharedPhotoStream": false,
      "iCloudRequireEncryptedBackup": false,
      "iTunesBlockExplicitContent": false,
      "iTunesBlockMusicService": false,
      "iTunesBlockRadio": false,
      "keyboardBlockAutoCorrect": false,
      "keyboardBlockDictation": false,
      "keyboardBlockPredictive": false,
      "keyboardBlockShortcuts": false,
      "keyboardBlockSpellCheck": false,
      "kioskModeAllowAssistiveSpeak": false,
      "kioskModeAllowAssistiveTouchSettings": false,
      "kioskModeAllowAutoLock": false,
      "kioskModeAllowColorInversionSettings": false,
      "kioskModeAllowRingerSwitch": false,
      "kioskModeAllowScreenRotation": false,
      "kioskModeAllowSleepButton": false,
      "kioskModeAllowTouchscreen": false,
      "kioskModeAllowVoiceOverSettings": false,
      "kioskModeAllowVolumeButtons": false,
      "kioskModeAllowZoomSettings": false,
      "kioskModeAppStoreUrl": null,
      "kioskModeBuiltInAppId": null,
      "kioskModeRequireAssistiveTouch": false,
      "kioskModeRequireColorInversion": false,
      "kioskModeRequireMonoAudio": false,
      "kioskModeRequireVoiceOver": false,
      "kioskModeRequireZoom": false,
      "kioskModeManagedAppId": null,
      "lockScreenBlockControlCenter": false,
      "lockScreenBlockNotificationView": false,
      "lockScreenBlockPassbook": false,
      "lockScreenBlockTodayView": false,
      "mediaContentRatingAustralia": null,
      "mediaContentRatingCanada": null,
      "mediaContentRatingFrance": null,
      "mediaContentRatingGermany": null,
      "mediaContentRatingIreland": null,
      "mediaContentRatingJapan": null,
      "mediaContentRatingNewZealand": null,
      "mediaContentRatingUnitedKingdom": null,
      "mediaContentRatingUnitedStates": null,
      "mediaContentRatingApps": "allAllowed",
      "messagesBlocked": false,
      "notificationsBlockSettingsModification": false,
      "passcodeBlockFingerprintUnlock": false,
      "passcodeBlockFingerprintModification": false,
      "passcodeBlockModification": false,
      "passcodeBlockSimple": false,
      "passcodeExpirationDays": null,
      "passcodeMinimumLength": null,
      "passcodeMinutesOfInactivityBeforeLock": null,
      "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
      "passcodeMinimumCharacterSetCount": null,
      "passcodePreviousPasscodeBlockCount": null,
      "passcodeSignInFailureCountBeforeWipe": null,
      "passcodeRequiredType": "deviceDefault",
      "passcodeRequired": false,
      "podcastsBlocked": false,
      "safariBlockAutofill": false,
      "safariBlockJavaScript": false,
      "safariBlockPopups": false,
      "safariBlocked": false,
      "safariCookieSettings": "browserDefault",
      "safariManagedDomains": [],
      "safariPasswordAutoFillDomains": [],
      "safariRequireFraudWarning": false,
      "screenCaptureBlocked": false,
      "siriBlocked": false,
      "siriBlockedWhenLocked": false,
      "siriBlockUserGeneratedContent": false,
      "siriRequireProfanityFilter": false,
      "spotlightBlockInternetResults": false,
      "voiceDialingBlocked": false,
      "wallpaperBlockModification": false,
      "wiFiConnectOnlyToConfiguredNetworks": false,
      "appsSingleAppModeList": [],
      "appsVisibilityList": [],
      "compliantAppsList": [],
      "networkUsageRules": []
    },
    {
      "@odata.type": "#microsoft.graph.macOSGeneralDeviceConfiguration",
      "id": "7a33aedc-fb9a-49cc-8b28-6f2d56a71d3b",
      "lastModifiedDateTime": "2020-02-03T21:12:01.781319Z",
      "createdDateTime": "2020-02-03T21:12:01.781319Z",
      "description": "",
      "displayName": "MAC2",
      "version": 1,
      "compliantAppListType": "none",
      "emailInDomainSuffixes": [],
      "passwordBlockSimple": false,
      "passwordExpirationDays": null,
      "passwordMinimumCharacterSetCount": null,
      "passwordMinimumLength": null,
      "passwordMinutesOfInactivityBeforeLock": null,
      "passwordMinutesOfInactivityBeforeScreenTimeout": null,
      "passwordPreviousPasswordBlockCount": null,
      "passwordRequiredType": "deviceDefault",
      "passwordRequired": false,
      "compliantAppsList": []
    },
    {
      "@odata.type": "#microsoft.graph.macOSDeviceFeaturesConfiguration",
      "id": "bf9e3704-7508-4fd3-b344-34e577b6596e",
      "lastModifiedDateTime": "2020-02-03T18:30:23.4353027Z",
      "createdDateTime": "2020-02-03T18:30:23.4353027Z",
      "description": "",
      "displayName": "MACos",
      "version": 1
    },
    {
      "@odata.type": "#microsoft.graph.iosDeviceFeaturesConfiguration",
      "id": "88c7461c-871e-4720-a9a9-c30ffdfc3746",
      "lastModifiedDateTime": "2020-02-03T18:28:37.6530075Z",
      "createdDateTime": "2020-02-03T18:28:37.6530075Z",
      "description": "",
      "displayName": "Sam Profile",
      "version": 1,
      "assetTagTemplate": null,
      "lockScreenFootnote": null,
      "homeScreenDockIcons": [],
      "homeScreenPages": [],
      "notificationSettings": []
    },
    {
      "@odata.type": "#microsoft.graph.iosDeviceFeaturesConfiguration",
      "id": "53016f3b-76b8-4702-839a-be16dc1228ce",
      "lastModifiedDateTime": "2020-02-03T20:42:45.6679576Z",
      "createdDateTime": "2020-02-03T20:42:45.6679576Z",
      "description": "",
      "displayName": "testProfile",
      "version": 1,
      "assetTagTemplate": "OpsCompass",
      "lockScreenFootnote": "\"Sam is a loser\"",
      "homeScreenDockIcons": [],
      "homeScreenPages": [],
      "notificationSettings": []
    },
    {
      "@odata.type": "#microsoft.graph.iosGeneralDeviceConfiguration",
      "id": "d2fe66ff-09d2-4be4-8e42-a9b21836faee",
      "lastModifiedDateTime": "2020-02-03T20:58:28.9776246Z",
      "createdDateTime": "2020-02-03T20:58:28.9776246Z",
      "description": "",
      "displayName": "testProfile2",
      "version": 1,
      "accountBlockModification": false,
      "activationLockAllowWhenSupervised": false,
      "airDropBlocked": false,
      "airDropForceUnmanagedDropTarget": false,
      "airPlayForcePairingPasswordForOutgoingRequests": false,
      "appleWatchBlockPairing": false,
      "appleWatchForceWristDetection": false,
      "appleNewsBlocked": false,
      "appsVisibilityListType": "none",
      "appStoreBlockAutomaticDownloads": false,
      "appStoreBlocked": false,
      "appStoreBlockInAppPurchases": false,
      "appStoreBlockUIAppInstallation": false,
      "appStoreRequirePassword": false,
      "bluetoothBlockModification": false,
      "cameraBlocked": false,
      "cellularBlockDataRoaming": false,
      "cellularBlockGlobalBackgroundFetchWhileRoaming": false,
      "cellularBlockPerAppDataModification": false,
      "cellularBlockPersonalHotspot": false,
      "cellularBlockVoiceRoaming": false,
      "certificatesBlockUntrustedTlsCertificates": false,
      "classroomAppBlockRemoteScreenObservation": false,
      "classroomAppForceUnpromptedScreenObservation": false,
      "compliantAppListType": "none",
      "configurationProfileBlockChanges": false,
      "definitionLookupBlocked": false,
      "deviceBlockEnableRestrictions": false,
      "deviceBlockEraseContentAndSettings": false,
      "deviceBlockNameModification": false,
      "diagnosticDataBlockSubmission": false,
      "diagnosticDataBlockSubmissionModification": false,
      "documentsBlockManagedDocumentsInUnmanagedApps": false,
      "documentsBlockUnmanagedDocumentsInManagedApps": false,
      "emailInDomainSuffixes": [],
      "enterpriseAppBlockTrust": false,
      "enterpriseAppBlockTrustModification": false,
      "faceTimeBlocked": false,
      "findMyFriendsBlocked": false,
      "gamingBlockGameCenterFriends": false,
      "gamingBlockMultiplayer": false,
      "gameCenterBlocked": false,
      "hostPairingBlocked": false,
      "iBooksStoreBlocked": false,
      "iBooksStoreBlockErotica": false,
      "iCloudBlockActivityContinuation": false,
      "iCloudBlockBackup": false,
      "iCloudBlockDocumentSync": false,
      "iCloudBlockManagedAppsSync": false,
      "iCloudBlockPhotoLibrary": false,
      "iCloudBlockPhotoStreamSync": false,
      "iCloudBlockSharedPhotoStream": false,
      "iCloudRequireEncryptedBackup": false,
      "iTunesBlockExplicitContent": false,
      "iTunesBlockMusicService": false,
      "iTunesBlockRadio": false,
      "keyboardBlockAutoCorrect": false,
      "keyboardBlockDictation": false,
      "keyboardBlockPredictive": false,
      "keyboardBlockShortcuts": false,
      "keyboardBlockSpellCheck": false,
      "kioskModeAllowAssistiveSpeak": false,
      "kioskModeAllowAssistiveTouchSettings": false,
      "kioskModeAllowAutoLock": false,
      "kioskModeAllowColorInversionSettings": false,
      "kioskModeAllowRingerSwitch": false,
      "kioskModeAllowScreenRotation": false,
      "kioskModeAllowSleepButton": false,
      "kioskModeAllowTouchscreen": false,
      "kioskModeAllowVoiceOverSettings": false,
      "kioskModeAllowVolumeButtons": false,
      "kioskModeAllowZoomSettings": false,
      "kioskModeAppStoreUrl": null,
      "kioskModeBuiltInAppId": null,
      "kioskModeRequireAssistiveTouch": false,
      "kioskModeRequireColorInversion": false,
      "kioskModeRequireMonoAudio": false,
      "kioskModeRequireVoiceOver": false,
      "kioskModeRequireZoom": false,
      "kioskModeManagedAppId": null,
      "lockScreenBlockControlCenter": false,
      "lockScreenBlockNotificationView": false,
      "lockScreenBlockPassbook": false,
      "lockScreenBlockTodayView": false,
      "mediaContentRatingAustralia": null,
      "mediaContentRatingCanada": null,
      "mediaContentRatingFrance": null,
      "mediaContentRatingGermany": null,
      "mediaContentRatingIreland": null,
      "mediaContentRatingJapan": null,
      "mediaContentRatingNewZealand": null,
      "mediaContentRatingUnitedKingdom": null,
      "mediaContentRatingUnitedStates": null,
      "mediaContentRatingApps": "allAllowed",
      "messagesBlocked": false,
      "notificationsBlockSettingsModification": false,
      "passcodeBlockFingerprintUnlock": false,
      "passcodeBlockFingerprintModification": false,
      "passcodeBlockModification": false,
      "passcodeBlockSimple": false,
      "passcodeExpirationDays": null,
      "passcodeMinimumLength": null,
      "passcodeMinutesOfInactivityBeforeLock": null,
      "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
      "passcodeMinimumCharacterSetCount": null,
      "passcodePreviousPasscodeBlockCount": 5,
      "passcodeSignInFailureCountBeforeWipe": null,
      "passcodeRequiredType": "deviceDefault",
      "passcodeRequired": true,
      "podcastsBlocked": false,
      "safariBlockAutofill": false,
      "safariBlockJavaScript": false,
      "safariBlockPopups": false,
      "safariBlocked": false,
      "safariCookieSettings": "browserDefault",
      "safariManagedDomains": [],
      "safariPasswordAutoFillDomains": [],
      "safariRequireFraudWarning": false,
      "screenCaptureBlocked": false,
      "siriBlocked": false,
      "siriBlockedWhenLocked": false,
      "siriBlockUserGeneratedContent": false,
      "siriRequireProfanityFilter": false,
      "spotlightBlockInternetResults": false,
      "voiceDialingBlocked": false,
      "wallpaperBlockModification": false,
      "wiFiConnectOnlyToConfiguredNetworks": false,
      "appsSingleAppModeList": [],
      "appsVisibilityList": [],
      "compliantAppsList": [],
      "networkUsageRules": []
    },
    {
      "@odata.type": "#microsoft.graph.windowsPhone81GeneralConfiguration",
      "id": "4f3284f1-d287-497e-b8ad-c396087478db",
      "lastModifiedDateTime": "2020-02-03T18:30:44.8111841Z",
      "createdDateTime": "2020-02-03T18:30:44.8111841Z",
      "description": "",
      "displayName": "Windows Phone",
      "version": 1,
      "applyOnlyToWindowsPhone81": false,
      "appsBlockCopyPaste": false,
      "bluetoothBlocked": false,
      "cameraBlocked": false,
      "cellularBlockWifiTethering": false,
      "compliantAppListType": "none",
      "diagnosticDataBlockSubmission": false,
      "emailBlockAddingAccounts": false,
      "locationServicesBlocked": false,
      "microsoftAccountBlocked": false,
      "nfcBlocked": false,
      "passwordBlockSimple": false,
      "passwordExpirationDays": null,
      "passwordMinimumLength": null,
      "passwordMinutesOfInactivityBeforeScreenTimeout": null,
      "passwordMinimumCharacterSetCount": null,
      "passwordPreviousPasswordBlockCount": null,
      "passwordSignInFailureCountBeforeFactoryReset": null,
      "passwordRequiredType": "deviceDefault",
      "passwordRequired": false,
      "screenCaptureBlocked": false,
      "storageBlockRemovableStorage": false,
      "storageRequireEncryption": false,
      "webBrowserBlocked": false,
      "wifiBlocked": false,
      "wifiBlockAutomaticConnectHotspots": false,
      "wifiBlockHotspotReporting": false,
      "windowsStoreBlocked": false,
      "compliantAppsList": []
    }
  ]
}