{
  "recommended_action": "1. Go to the IAM page in the GCP Console using\nhttps://console.cloud.google.com/iam-admin/iam\n2. Click on filter table text bar, Type Role: Service Account User\n3. Click Delete Bin icon in front of role Service Account User for every user listed as\na result of a filter",
  "rationale": "A service account is a special Google account that belongs to application or a virtual machine (VM), instead of to an individual end user. Application/VM-Instance uses the service account to call the Google API of a service, so that the users aren't directly involved. In addition to being an identity, a service account is a resource which has IAM policies attached to it. These policies determine who can use the service account. Users with IAM roles to update the App Engine and Compute Engine instances (such as App Engine Deployer or Compute Instance Admin) can effectively run code as the service accounts used to run these instances, and indirectly gain access to all the resources for which the service accounts has access. Similarly, SSH access to a Compute Engine instance may also provide the ability to execute code as that instance/Service account. As per business needs, there could be multiple user-managed service accounts configured for a project. Granting the iam.serviceAccountUserrole to a user for a project gives the user access to all service accounts in the project, including service accounts that may be created in the future. This can result into elevation of privileges by using service accounts and corresponding Compute Engine instances. In order to implement least privilegesbest practices, IAM users should not be assigned Service Account Userrole at projectlevel. Instead iam.serviceAccountUserrole should be assigned to a user for a specific service account giving a user access to the service account.",
  "source": "cis gcp 1.0.0",
  "properties": {
    "document": {
      "properties": {
        "bindings": {
          "not": {
            "errorMessage": "IAM user is assigned role of a Service Account User.",
            "contains": {
              "properties": {
                "role": {
                  "constIgnoreCase": "roles/iam.serviceaccountuser"
                },
                "members": {
                  "contains": {
                    "pattern": "^user:"
                  }
                }
              }
            }
          },
          "errorMessage": "IAM user is assigned role of a Service Account User."
        }
      }
    }
  },
  "schemaId": "4ee335c7-7ea7-b6b2-8fca-afc9ce2f1112"
}
