{
  "recommended_action": "Delete external (user managed) Service Account Key older than 90 days: \n 1. Go to APIs & Services Credentials using\nhttps://console.cloud.google.com/apis/credentials\n2. In Section Service Account Keys, for every external (user managed) Service\naccount key with creation date is more than or equal to past 90 days click Delete\nBin Icon to Delete Service Account key\nCreate New external (user managed) Service Account Key for a Service Account:\n1. Go to APIs & Services Credentials using\nhttps://console.cloud.google.com/apis/credentials\n2. Click Create Credentials and Select Service Account Key\n3. Choose Service account in drop-down list for which External (user managed)\nService Account key needs to be created\n4. Select desired key type format among JSON or P12\n5. Click Create. It will download private key. Keep it safe.\n6. Click Close if prompted\n7. It will redirect to APIs & Services Credentials page. Make a note of New ID\ndisplayed in section Service account keys",
  "rationale": "Rotating Service Account keys will reduce the window of opportunity for an access key that is associated with a compromised or terminated account to be used. Service Account keys should be rotated to ensure that data cannot be accessed with an old key which might have been lost, cracked, or stolen.Each service account is associated with a key pair, which is managed by Google Cloud Platform (GCP). It is used for service-to-service authentication within GCP. Google rotates the keys daily.GCP provides option to create one or more user-managed (also called as external key pairs) key pairs for use from outside GCP (for example, for use with Application Default Credentials). When a new key pair is created, user is enforced download the private key (which is not retained by Google). With external keys, users are responsible for security of the private key and other management operations such as key rotation. External keys can be managed by the IAM API, gcloud command-line tool, or the Service Accounts page in the Google Cloud Platform Console. GCP facilitates up to 10 external service account keys per service account to facilitate key rotation.",
  "source": "cis gcp 1.0.0",
  "properties": {
    "keys": {
      "items": {
        "properties": {
          "validAfterTime": {
            "errorMessage": "Service account keys are more than 90 days old.",
            "withinDays": 89
          }
        }
      }
    }
  },
  "schemaId": "db8886d0-eedb-886a-4177-46176c1645e4"
}
