{
  "document": [
    {
      "@odata.type": "#microsoft.graph.androidCompliancePolicy",
      "roleScopeTagIds": [
        "0"
      ],
      "id": "55e38687-6517-4940-9ef1-28b065c1c0ec",
      "createdDateTime": "2020-05-09T02:42:39.2358333Z",
      "description": null,
      "lastModifiedDateTime": "2020-05-09T02:42:39.2358333Z",
      "displayName": "Force 6 digit passcode - DA",
      "version": 1,
      "passwordRequired": true,
      "passwordMinimumLength": 6,
      "passwordRequiredType": "numeric",
      "requiredPasswordComplexity": "none",
      "passwordMinutesOfInactivityBeforeLock": 15,
      "passwordExpirationDays": null,
      "passwordPreviousPasswordBlockCount": null,
      "passwordSignInFailureCountBeforeFactoryReset": null,
      "securityPreventInstallAppsFromUnknownSources": false,
      "securityDisableUsbDebugging": false,
      "securityRequireVerifyApps": false,
      "deviceThreatProtectionEnabled": false,
      "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
      "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
      "securityBlockJailbrokenDevices": false,
      "securityBlockDeviceAdministratorManagedDevices": false,
      "osMinimumVersion": null,
      "osMaximumVersion": null,
      "minAndroidSecurityPatchLevel": null,
      "storageRequireEncryption": false,
      "securityRequireSafetyNetAttestationBasicIntegrity": false,
      "securityRequireSafetyNetAttestationCertifiedDevice": false,
      "securityRequireGooglePlayServices": false,
      "securityRequireUpToDateSecurityProviders": false,
      "securityRequireCompanyPortalAppIntegrity": false,
      "conditionStatementId": null,
      "restrictedApps": [],
      "definitionName": "",
      "accountId": "d6cfda6e-5f9b-4e1a-94db-7378f2e6eb4c",
      "type": "",
      "location": "global"
    },
    {
      "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
      "roleScopeTagIds": [
        "0"
      ],
      "id": "5a9feb5a-1202-4417-a102-47078c2369b0",
      "createdDateTime": "2021-03-02T20:37:13.4755882Z",
      "description": null,
      "lastModifiedDateTime": "2021-03-02T20:37:13.4755882Z",
      "displayName": "Require Bitlocker",
      "version": 1,
      "passwordRequired": false,
      "passwordBlockSimple": false,
      "passwordRequiredToUnlockFromIdle": false,
      "passwordMinutesOfInactivityBeforeLock": null,
      "passwordExpirationDays": null,
      "passwordMinimumLength": null,
      "passwordMinimumCharacterSetCount": null,
      "passwordRequiredType": "deviceDefault",
      "passwordPreviousPasswordBlockCount": null,
      "requireHealthyDeviceReport": false,
      "osMinimumVersion": null,
      "osMaximumVersion": null,
      "mobileOsMinimumVersion": null,
      "mobileOsMaximumVersion": null,
      "earlyLaunchAntiMalwareDriverEnabled": false,
      "bitLockerEnabled": false,
      "secureBootEnabled": false,
      "codeIntegrityEnabled": false,
      "storageRequireEncryption": true,
      "activeFirewallRequired": false,
      "defenderEnabled": false,
      "defenderVersion": null,
      "signatureOutOfDate": false,
      "rtpEnabled": false,
      "antivirusRequired": false,
      "antiSpywareRequired": false,
      "deviceThreatProtectionEnabled": false,
      "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
      "configurationManagerComplianceRequired": false,
      "tpmRequired": false,
      "deviceCompliancePolicyScript": null,
      "validOperatingSystemBuildRanges": [],
      "definitionName": "",
      "accountId": "d6cfda6e-5f9b-4e1a-94db-7378f2e6eb4c",
      "type": "",
      "location": "global"
    },
    {
      "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
      "roleScopeTagIds": [
        "0"
      ],
      "id": "786392ea-cae6-4622-8530-07bc1c682654",
      "createdDateTime": "2021-03-02T20:53:27.544939Z",
      "description": null,
      "lastModifiedDateTime": "2021-03-02T20:53:27.544939Z",
      "displayName": "Require Encryption",
      "version": 1,
      "passwordRequired": false,
      "passwordBlockSimple": false,
      "passwordExpirationDays": null,
      "passwordMinimumLength": null,
      "passwordMinutesOfInactivityBeforeLock": null,
      "passwordPreviousPasswordBlockCount": null,
      "passwordMinimumCharacterSetCount": null,
      "passwordRequiredType": "deviceDefault",
      "osMinimumVersion": null,
      "osMaximumVersion": null,
      "osMinimumBuildVersion": null,
      "osMaximumBuildVersion": null,
      "systemIntegrityProtectionEnabled": false,
      "deviceThreatProtectionEnabled": false,
      "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
      "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
      "storageRequireEncryption": true,
      "gatekeeperAllowedAppSource": "notConfigured",
      "firewallEnabled": false,
      "firewallBlockAllIncoming": false,
      "firewallEnableStealthMode": false,
      "definitionName": "",
      "accountId": "d6cfda6e-5f9b-4e1a-94db-7378f2e6eb4c",
      "type": "",
      "location": "global"
    },
    {
      "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
      "roleScopeTagIds": [
        "0"
      ],
      "id": "c2a09fd0-4b86-47dd-bfd7-4cbb125f3fe7",
      "createdDateTime": "2020-04-24T18:48:57.0907619Z",
      "description": null,
      "lastModifiedDateTime": "2020-05-12T22:03:55.419094Z",
      "displayName": "Force 6 digit passcode",
      "version": 3,
      "deviceThreatProtectionEnabled": false,
      "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
      "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
      "securityRequireSafetyNetAttestationBasicIntegrity": false,
      "securityRequireSafetyNetAttestationCertifiedDevice": false,
      "osMinimumVersion": null,
      "osMaximumVersion": null,
      "minAndroidSecurityPatchLevel": null,
      "passwordRequired": true,
      "passwordMinimumLength": 6,
      "passwordMinimumLetterCharacters": null,
      "passwordMinimumLowerCaseCharacters": null,
      "passwordMinimumNonLetterCharacters": null,
      "passwordMinimumNumericCharacters": null,
      "passwordMinimumSymbolCharacters": null,
      "passwordMinimumUpperCaseCharacters": null,
      "passwordRequiredType": "numeric",
      "passwordMinutesOfInactivityBeforeLock": null,
      "passwordExpirationDays": null,
      "passwordPreviousPasswordCountToBlock": null,
      "storageRequireEncryption": true,
      "securityRequireIntuneAppIntegrity": null,
      "definitionName": "",
      "accountId": "d6cfda6e-5f9b-4e1a-94db-7378f2e6eb4c",
      "type": "",
      "location": "global"
    },
    {
      "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
      "roleScopeTagIds": [
        "0"
      ],
      "id": "d10de24b-4e6e-4434-8f71-f0b081a2f086",
      "createdDateTime": "2020-07-16T21:18:26.8944878Z",
      "description": null,
      "lastModifiedDateTime": "2020-11-17T20:53:41.9673965Z",
      "displayName": "Mac Security Settings",
      "version": 2,
      "passwordRequired": true,
      "passwordBlockSimple": true,
      "passwordExpirationDays": 65535,
      "passwordMinimumLength": 12,
      "passwordMinutesOfInactivityBeforeLock": 1,
      "passwordPreviousPasswordBlockCount": null,
      "passwordMinimumCharacterSetCount": null,
      "passwordRequiredType": "alphanumeric",
      "osMinimumVersion": null,
      "osMaximumVersion": null,
      "osMinimumBuildVersion": null,
      "osMaximumBuildVersion": null,
      "systemIntegrityProtectionEnabled": false,
      "deviceThreatProtectionEnabled": false,
      "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
      "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
      "storageRequireEncryption": true,
      "gatekeeperAllowedAppSource": "notConfigured",
      "firewallEnabled": true,
      "firewallBlockAllIncoming": false,
      "firewallEnableStealthMode": false,
      "definitionName": "",
      "accountId": "d6cfda6e-5f9b-4e1a-94db-7378f2e6eb4c",
      "type": "",
      "location": "global"
    },
    {
      "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
      "roleScopeTagIds": [
        "0"
      ],
      "id": "e2440091-56f6-4d39-930c-6f2ccaa24681",
      "createdDateTime": "2020-05-18T19:33:49.1851862Z",
      "description": null,
      "lastModifiedDateTime": "2022-08-19T21:05:51.7395591Z",
      "displayName": "Hello Requirements",
      "version": 3,
      "passwordRequired": true,
      "passwordBlockSimple": true,
      "passwordRequiredToUnlockFromIdle": true,
      "passwordMinutesOfInactivityBeforeLock": 15,
      "passwordExpirationDays": 730,
      "passwordMinimumLength": 12,
      "passwordMinimumCharacterSetCount": 3,
      "passwordRequiredType": "alphanumeric",
      "passwordPreviousPasswordBlockCount": null,
      "requireHealthyDeviceReport": false,
      "osMinimumVersion": null,
      "osMaximumVersion": null,
      "mobileOsMinimumVersion": null,
      "mobileOsMaximumVersion": null,
      "earlyLaunchAntiMalwareDriverEnabled": false,
      "bitLockerEnabled": false,
      "secureBootEnabled": false,
      "codeIntegrityEnabled": false,
      "storageRequireEncryption": false,
      "activeFirewallRequired": false,
      "defenderEnabled": false,
      "defenderVersion": null,
      "signatureOutOfDate": false,
      "rtpEnabled": false,
      "antivirusRequired": false,
      "antiSpywareRequired": false,
      "deviceThreatProtectionEnabled": false,
      "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
      "configurationManagerComplianceRequired": false,
      "tpmRequired": false,
      "deviceCompliancePolicyScript": null,
      "validOperatingSystemBuildRanges": [],
      "definitionName": "",
      "accountId": "d6cfda6e-5f9b-4e1a-94db-7378f2e6eb4c",
      "type": "",
      "location": "global"
    },
    {
      "@odata.type": "#microsoft.graph.iosCompliancePolicy",
      "roleScopeTagIds": [
        "0"
      ],
      "id": "f1042405-ae5e-4ca8-ac50-0cd679039be8",
      "createdDateTime": "2020-04-24T19:05:47.8275814Z",
      "description": null,
      "lastModifiedDateTime": "2020-11-09T19:09:54.6326536Z",
      "displayName": "Force 6 digit passcode iOS",
      "version": 3,
      "passcodeBlockSimple": true,
      "passcodeExpirationDays": 65535,
      "passcodeMinimumLength": 6,
      "passcodeMinutesOfInactivityBeforeLock": null,
      "passcodeMinutesOfInactivityBeforeScreenTimeout": 1,
      "passcodePreviousPasscodeBlockCount": null,
      "passcodeMinimumCharacterSetCount": null,
      "passcodeRequiredType": "numeric",
      "passcodeRequired": true,
      "osMinimumVersion": null,
      "osMaximumVersion": null,
      "osMinimumBuildVersion": null,
      "osMaximumBuildVersion": null,
      "securityBlockJailbrokenDevices": true,
      "deviceThreatProtectionEnabled": false,
      "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
      "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
      "managedEmailProfileRequired": false,
      "restrictedApps": [],
      "definitionName": "",
      "accountId": "d6cfda6e-5f9b-4e1a-94db-7378f2e6eb4c",
      "type": "",
      "location": "global"
    }
  ]
}