{
  "document": [
    {
      "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
      "roleScopeTagIds": [
        "0"
      ],
      "id": "e2440091-56f6-4d39-930c-6f2ccaa24681",
      "createdDateTime": "2020-05-18T19:33:49.1851862Z",
      "description": null,
      "lastModifiedDateTime": "2022-08-19T21:05:51.7395591Z",
      "displayName": "Hello Requirements",
      "version": 3,
      "passwordRequired": true,
      "passwordBlockSimple": true,
      "passwordRequiredToUnlockFromIdle": true,
      "passwordMinutesOfInactivityBeforeLock": 15,
      "passwordExpirationDays": 730,
      "passwordMinimumLength": 12,
      "passwordMinimumCharacterSetCount": 3,
      "passwordRequiredType": "alphanumeric",
      "passwordPreviousPasswordBlockCount": null,
      "requireHealthyDeviceReport": false,
      "osMinimumVersion": null,
      "osMaximumVersion": null,
      "mobileOsMinimumVersion": null,
      "mobileOsMaximumVersion": null,
      "earlyLaunchAntiMalwareDriverEnabled": false,
      "bitLockerEnabled": false,
      "secureBootEnabled": false,
      "codeIntegrityEnabled": false,
      "storageRequireEncryption": false,
      "not_activeFirewallRequired": false,
      "defenderEnabled": false,
      "defenderVersion": null,
      "signatureOutOfDate": false,
      "rtpEnabled": false,
      "not_antivirusRequired": false,
      "not_antiSpywareRequired": false,
      "deviceThreatProtectionEnabled": false,
      "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
      "configurationManagerComplianceRequired": false,
      "tpmRequired": false,
      "deviceCompliancePolicyScript": null,
      "validOperatingSystemBuildRanges": [],
      "definitionName": "",
      "accountId": "d6cfda6e-5f9b-4e1a-94db-7378f2e6eb4c",
      "type": "",
      "location": "global"
    }
  ]
}